---
kind: other
id: Properties.T:Autodesk.Revit.DB.RoofType
source: html/837de4e8-d07b-c09c-64fa-8e0d08fff9a6.htm
---
# RoofType Properties

The id of the assembly instance to which the element belongs.